app/views/plant_groups/_form.html.erb

SELECT "plants".* FROM "plants" WHERE "plants"."id" = 1 LIMIT 1
---
		<select class="listselect" name="myfield[]">
			<option value="1"><%= Plant.find(1).name %></option>