app/views/shared/_plants_form.html.erb

                                           @project_id) do |f| %>
    <%= collection_select :prelationship, :pfollower_id, Plant.all, :id,
                          :name, {},:multiple => true,
                          :class => "listselect" %>
---
SELECT "plants".* FROM "plants" GROUP BY all
SELECT "prelationships".* FROM "prelationships" WHERE ("prelationships".pfollower_id = 87)