app/views/shared/_plant_group_form.html.erb


<%= collection_select(:prelationships, :pfollowed_id, Plant.all, :id, :name, options ={:prompt => "-Select your plants"}, :class => "listselect") %>
---
SELECT "plants".* FROM "plants"