app/views/projects/_plants_form.html.erb

SELECT "plants".* FROM "plants" ORDER BY group
---
                                           @project_id) do |f| %>
    <%= collection_select :prelationship, :pfollower_id, Plant.all, :id,
                          :group, {},:multiple => true,
                          :class => "listselect" %>