app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = 1 ORDER BY title LIMIT 1
INSERT INTO "carts" ("created_at", "updated_at") VALUES ('2012-01-24 14:32:52.104736', '2012-01-24 14:32:52.104736')
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at", "quantity", "order_id") VALUES (1, 2, '2012-01-29 11:36:57.492457', '2012-01-29 11:36:57.492457', 1, NULL)
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-01-24 14:46:56.278162' WHERE "line_items"."id" = 1
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save