app/controllers/orders_controller.rb

  def index
    @orders = Order.paginate :page=>params[:page], :order=>'created_at desc',
      :per_page => 10
---
SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"

  def new
    @cart = current_cart
    if @cart.line_items.empty?
---
SELECT "line_items".* FROM "line_items" WHERE ("line_items".cart_id = 1)
SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 1)

  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES ('2012-01-30 17:22:57.058255', '2012-01-30 17:22:57.058255')
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES ('Dave Thomas', 'Wendy''s', 'matt.m.melone@gmail.com', 'Credit card', '2012-01-30 16:52:54.588901', '2012-01-30 16:52:54.588901')
DELETE FROM "carts" WHERE "carts"."id" = 9