app/controllers/plant_groups_controller.rb

SELECT "plant_groups".* FROM "plant_groups" WHERE "plant_groups"."id" = 1 LIMIT 1
---
  def show
    @plant_group = PlantGroup.find(params[:id])

INSERT INTO "plant_groups" ("created_at", "updated_at", "project_id", "plant1") VALUES ('2011-11-06 20:36:38.118833', '2011-11-06 20:36:38.118833', NULL, NULL)
---
  def create
    @plant_group = PlantGroup.new(params[:plant_group])
    if @plant_group.save