app/controllers/prelationships_controller.rb

  def create
    @project = Project.find(params[:project_id])
    params[:prelationship][:pfollower_id].each do |p|
      @project.pfollow!( Plant.find(p) )
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 0 LIMIT 1
SELECT "plants".* FROM "plants" WHERE "plants"."id" = 5 LIMIT 1