app/controllers/projects_controller.rb

  def create
    @project = Project.new(params[:project])
    if @project.save
---
INSERT INTO "projects" ("title", "user_id", "address", "latitude", "longitude", "state", "created_at", "updated_at") VALUES ('', NULL, '79 Unwin Drive, Hamilton, NJ', NULL, NULL, '', '2011-10-21 15:06:41.923294', '2011-10-21 15:06:41.923294')

  def instructions
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 94 LIMIT 1